Q101. Write the Python program to add, subtract, multiply and divide two pandas series ? Sample Series- [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [2]:
import pandas as pd
import numpy as np

In [12]:
ser1 = pd.Series([2, 4, 6, 8, 10])
ser2 = pd.Series([1, 3, 5, 7, 9])
print(ser1+ser2)
print(ser1-ser2)
print(ser1*ser2)
print(ser1/ser2)

0     3
1     7
2    11
3    15
4    19
dtype: int64
0    1
1    1
2    1
3    1
4    1
dtype: int64
0     2
1    12
2    30
3    56
4    90
dtype: int64
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

Q102. Write a Python program to convert a dictionary to the Pandas Series?
Sample Series- Original dictionary- {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800} 
Converted series - a 100 b 200 c 300 d 400 e 800 dtype- int64

In [14]:
pd.Series({'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800})

a    100
b    200
c    300
d    400
e    800
dtype: int64

Q103. Write a python program to change the data type of given a column or a Series?
Sample Series- Original Data Series- 0 100

1 200 2 python 3 300.12 4 400 dtype- object Change the said data type to numeric- 0 100.00 1 200.00 2 NaN 3 300.12 4 400.00 dtype- float64

In [39]:
ser_type = pd.Series([100,200,'Python', 300.12,400])
pd.to_numeric(ser_type, errors='coerce')

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

Q104. Write the python pandas program to convert the first column of a DataFrame as a Series?

In [58]:
arr = [[1,4,7], [2,5,5],[3,6,8], [4,9,12], [7,5,1], [11,0,11]]
df2=pd.DataFrame(arr, columns=['col1', 'col2', 'col3'])
#df2.iloc[1,0]
#df2.shape[0]
pd.Series([df2.iloc[x,0] for x in range(df2.shape[0])])

0     1
1     2
2     3
3     4
4     7
5    11
dtype: int64

Q105. Write a pandas program to create the mean and standard deviation of the data of a given Series?

In [67]:
ser =pd.Series([1,2,3,4,5,6,7,8,9,5,3])
print(ser.mean())
print(ser.std())

4.818181818181818
2.522624895547565

Q106. Write a pandas program to get powers of an array values element-wise?

In [3]:
pd.DataFrame({'X ':[78,85,96,80,86], ' Y ':[84,94,89,83,86],'Z':[86,97,96,72,83]})

   X    Y    Z
0  78   84  86
1  85   94  97
2  96   89  96
3  80   83  72
4  86   86  83

Q107. Write the pandas program to get the first 3 rows of a given DataFrame?

In [3]:
exam_data = {'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],  'qualify': [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] ,'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19] }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
df = pd.DataFrame(exam_data, labels)
df[0:3]

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

Q108: Write the pandas program to select the specified columns and the rows from a given data frame?

In [9]:
df.loc[['b','d','f','g'],['name','score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

Q109. Write the pandas program to calculate mean score for each different student in DataFrame?

In [1]:
df["mean"] = df["score"]/df["attempts"]
df["score"]

NameError: name 'df' is not defined

Q110. Write the Pandas program to rename columns of a given DataFrame ?

In [10]:
df =pd.DataFrame({'col1': [0, 1, 4, 7], 'col2': [1, 2, 5, 8], 'col3': [2, 3, 6, 9] })
df2=df.rename(columns = {'col1':'column1','col2':'column2','col3':'column3'})
df2

   column1  column2  column3
0        0        1        2
1        1        2        3
2        4        5        6
3        7        8        9

Q111. Write a pandas program to count city-wise number of people from a given of data set (city, name of the person)?

Q112. Write a pandas program to widen output display to see more columns?

Q113. Write a pandas program to convert the data frame column type from string to DateTime?

In [15]:
pd.DataFrame(pd.to_datetime(pd.Series(['3/11/2000','3/12/2000','3/13/2000'])))

           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

Q114. Write a pandas program to append the data to an empty DataFrame?

In [29]:
df =pd.DataFrame()
df2= pd.DataFrame({'col1':[0,1,2], 'col2':[0,1,2]})
df =df2.append(df)
df

   col1  col2
0     0     0
1     1     1
2     2     2

Q115. Write a pandas program to count the number of columns of a DataFrame?

In [33]:
df.shape[1]

2

Q116. Write a Pandas program to remove the last n rows of a given DataFrame ?

In [64]:

df =pd.DataFrame({'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]})
df.iloc[:3]

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

Q117. Write a Pandas program to import excel data (coalpublic2013.xlsx ) into a Pandas data frame.

In [88]:
df = pd.read_excel("C:/Users/mahes/Downloads/coalpublic2013.xlsx")
df.head(10)

   Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0  2013   103381            Tacoa Highwall Miner       56004        22392
1  2013   103404                Reid School Mine       28807        28447
2  2013   100759  North River #1 Underground Min     1440115       474784
3  2013   103246                      Bear Creek       87587        29193
4  2013   103451                     Knight Mine      147499        46393
5  2013   103433              Crane Central Mine       69339        47195
6  2013   100329                    Concord Mine           0       144002
7  2013   100851                  Oak Grove Mine     2269014      1001809
8  2013   102901                Shoal Creek Mine           0        12396
9  2013   102901                Shoal Creek Mine     1453024      1237415

In [92]:
df.dtypes

Year            int64
MSHA ID         int64
Mine_Name      object
Production      int64
Labor_Hours     int64
dtype: object

Q118. Write a Pandas program to import excel data (coalpublic2013.xlsx ) into a data frame and find details where "Mine Name" starts with "P.

In [85]:
df[df['Mine_Name'].map(lambda x: x.startswith("P"))]

    Year  MSHA ID                      Mine_Name  Production  Labor_Hours
13  2013   103332                  Powhatan Mine      140521        61394
18  2013   102976  Piney Woods Preparation Plant           0        14828
19  2013   102976  Piney Woods Preparation Plant           0        23193
46  2013   103321                 Poplar Springs      189370        76366

Write a Pandas program to import excel data (employee.xlsx ) into a Pandas dataframe and find the list of employees where hire_date> 01-01-07.

In [104]:
df = pd.read_excel("C:/Users/mahes/Downloads/employee.xlsx")
df.describe()
df.dtypes
#df.head()
#df[df['hire_date']>='2007-01-01']

emp_id                 int64
first_name            object
last_name             object
hire_date     datetime64[ns]
dtype: object

Q120. Write a Pandas program to import excel data (employee.xlsx ) into a Pandas dataframe and find a list of the employees of a specified year

In [109]:
res = df.set_index(['hire_date'])["2005"]
res

            emp_id first_name last_name
hire_date
2005-09-21     101      Neena   Kochhar
2005-06-25     105      David    Austin
2005-09-28     110       John      Chen
2005-09-30     111     Ismael   Sciarra
2005-12-24     116     Shelli     Baida
2005-07-24     117      Sigal    Tobias

Q121. Write a pandas program to import three datasheets from a given excel data (coalpublic2013.xlsx ) in to a single dataframe.